# ¿Como hacer un Data Frame?

In [16]:
import pandas as pd
import numpy as np

In [10]:
data={
    'nombre':
    ['fer','maggs','rafa','Sai','bobi'],
    'edad':
    ['20','18','19','19',19],
    'Materia':
    ['DATA','Diseño','Aero','Sobre','Soccer']
    
}

In [11]:
df = pd.DataFrame(data)

In [12]:
df

  nombre edad Materia
0    fer   20    DATA
1  maggs   18  Diseño
2   rafa   19    Aero
3    sai   19   Sobre
4   bobi   19  Soccer

In [14]:
print('\n'*2)

In [32]:
#DATOS NO VALIDO
data={
    'nombre':
    ['fer','maggs',np.nan,'sai','bobi'],
    'edad':
    ['20','18','19','19',np.nan],
    'Materia':
    ['DATA','Diseño','Aero','Sobre',np.nan]
    
}

In [33]:
df = pd.DataFrame(data)

In [34]:
df

  nombre edad Materia
0    fer   20    DATA
1  maggs   18  Diseño
2    NaN   19    Aero
3    sai   19   Sobre
4   bobi  NaN     NaN

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
nombre     4 non-null object
edad       4 non-null object
Materia    4 non-null object
dtypes: object(3)
memory usage: 200.0+ bytes

In [36]:
#Estadisticas basicas de informacion

In [37]:
df.describe()

       nombre edad Materia
count       4    4       4
unique      4    3       4
top       fer   19  Diseño
freq        1    2       1

In [38]:
#Reemplazamos valores falntantes con un cero
new = pd.DataFrame(df)
new = new.replace(np.nan,"0")

In [39]:
new

  nombre edad Materia
0    fer   20    DATA
1  maggs   18  Diseño
2      0   19    Aero
3    sai   19   Sobre
4   bobi    0       0